app/controllers/main_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY id DESC LIMIT 5
---
  def index
  	@posts = Post.limit(5).order("id DESC")

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
---
  def post
  	@post = Post.find(params[:id])